## Experiment 6
---
###**Aim:** To transform raw data to a clean and organized format ready for use.

# Data Manipulation and Wrangling

### 6.0 Introduction
Data wrangling is a broad term used, often informally, to describe the process of transforming raw data to a clean and organized format ready for use.

Data wrangling is the process of cleaning and unifying messy and complex data sets for easy access and analysis. This process typically includes manually converting and mapping data from one raw form into another format to allow for more convenient consumption and organization of the data.

The most common data structure used to "wrangle" data is the data frame, which can be both intuitive and incredibly versatile. Data frames are tabular, meaning that they are based on rows and columns like you'd find in a spreadsheet.

### 6.1 Creating a Data Frame

In [ ]:
#importing 
import pandas as pd
dataframe = pd.DataFrame()

Pandas is a software library written for the Python programming language for data manipulation and analysis. In particular, it offers data structures and operations for manipulating numerical tables and time series. 
* For more on pandas: https://pandas.pydata.org/

### 6.2 Describing the Data
  To view some characteristics of a data frame

In [ ]:
url = "https://raw.githubusercontent.com/chrisalbon/simulated_datasets/master/titanic.csv"
df = pd.read_csv(url)
# show first two rows
print('First two rows: \n',df.head(2)) 
# also try for last two rows
print('\n Last two rows: \n', df.tail(2))

# show dimensions
print('\n Dimensions: ',df.shape)
# also try
print("\n Dimensions: {}".format(df.shape))

# show statistics
print('\n Data statistics are')
df.describe()

First two rows:
                            Name PClass   Age     Sex  Survived  SexCode
0  Allen, Miss Elisabeth Walton    1st  29.0  female         1        1
1   Allison, Miss Helen Loraine    1st   2.0  female         0        1

 Last two rows:
                   Name PClass   Age   Sex  Survived  SexCode
1311  Lievens, Mr Rene    3rd  24.0  male         0        0
1312    Zimmerman, Leo    3rd  29.0  male         0        0

 Dimensions:  (1313, 6)

 Dimensions: (1313, 6)

 Data statistics are

              Age     Survived      SexCode
count  756.000000  1313.000000  1313.000000
mean    30.397989     0.342727     0.351866
std     14.259049     0.474802     0.477734
min      0.170000     0.000000     0.000000
25%     21.000000     0.000000     0.000000
50%     28.000000     0.000000     0.000000
75%     39.000000     1.000000     1.000000
max     71.000000     1.000000     1.000000

### 6.1.2 Navigating DataFrames
  How to select individual data or slices of dataframe

In [ ]:
# select the first row
print(df.iloc[0])

# select three rows (0,1,2)
print('\n', df.iloc[0:3])

# all rows up to and including the fourth row
print('\n', df.iloc[:4])

Name        Allen, Miss Elisabeth Walton
PClass                               1st
Age                                   29
Sex                               female
Survived                               1
SexCode                                1
Name: 0, dtype: object

                                   Name PClass   Age     Sex  Survived  SexCode
0         Allen, Miss Elisabeth Walton    1st  29.0  female         1        1
1          Allison, Miss Helen Loraine    1st   2.0  female         0        1
2  Allison, Mr Hudson Joshua Creighton    1st  30.0    male         0        0

                                             Name PClass  ...  Survived SexCode
0                   Allen, Miss Elisabeth Walton    1st  ...         1       1
1                    Allison, Miss Helen Loraine    1st  ...         0       1
2            Allison, Mr Hudson Joshua Creighton    1st  ...         0       0
3  Allison, Mrs Hudson JC (Bessie Waldo Daniels)    1st  ...         0       1

[4 rows x 6 columns]

Data Frames do not need to be numerically indexed. We can set the index of a Data Frame to any value where the value is unique to each row. For example, we can set the index to be passenger names and then select rows using a name:

In [ ]:
# set index
df = df.set_index(df['Name'])

# show row
df.loc['Allen, Miss Elisabeth Walton']

Name        Allen, Miss Elisabeth Walton
PClass                               1st
Age                                   29
Sex                               female
Survived                               1
SexCode                                1
Name: Allen, Miss Elisabeth Walton, dtype: object

### Discussion
To select individual rows and slices of rows, pandas provides two methods:
* `loc` is useful when the index of the DataFrame is a label (a string)
* `iloc` works by looking for the position in the DataFrame. For exmaple, iloc[0] will return the first row regardless of whether the index is an integer or a label.

## 6.4 Selecting Rows Based on Conditionals

In [ ]:
# select top two rows where column 'sex' is 'female'
df[df["Sex"]=="female"].head(2)

                                                      Name  ... SexCode
Name                                                        ...
Allen, Miss Elisabeth Walton  Allen, Miss Elisabeth Walton  ...       1
Allison, Miss Helen Loraine    Allison, Miss Helen Loraine  ...       1

[2 rows x 6 columns]

In [ ]:
# multiple conditions
df[(df['Sex'] == 'female') & (df['Age'] >= 65)]

                                                 Name PClass  ...  Survived SexCode
73  Crosby, Mrs Edward Gifford (Catherine Elizabet...    1st  ...         1       1

[1 rows x 6 columns]

## 6.5 Replacing Values

In [ ]:
# replace any instance of 'female' with Woman
df['Sex'].replace('female', 'Woman').head(2)

Name
Allen, Miss Elisabeth Walton    Woman
Allison, Miss Helen Loraine     Woman
Name: Sex, dtype: object

We can replace multiple values at the same time

In [ ]:
# replace any instance of 'female' with Woman and 'male' with Man
df['Sex'].replace(['female', 'male'], ['Woman', 'Man']).head(5)

Name
Allen, Miss Elisabeth Walton                     Woman
Allison, Miss Helen Loraine                      Woman
Allison, Mr Hudson Joshua Creighton                Man
Allison, Mrs Hudson JC (Bessie Waldo Daniels)    Woman
Allison, Master Hudson Trevor                      Man
Name: Sex, dtype: object

Try to replace across the entire dataframe object by specifying the whole dataframe instead of a single columm:

In [ ]:
df.replace(1, "One").head(2)

                                                      Name  ... SexCode
Name                                                        ...
Allen, Miss Elisabeth Walton  Allen, Miss Elisabeth Walton  ...     One
Allison, Miss Helen Loraine    Allison, Miss Helen Loraine  ...     One

[2 rows x 6 columns]

## 6.6 Renaming Columns
We can rename a column in Pandas Dataframe

In [ ]:
df.rename(columns={'PClass': 'Passenger Class'}).head(2)

                                                      Name  ... SexCode
Name                                                        ...
Allen, Miss Elisabeth Walton  Allen, Miss Elisabeth Walton  ...       1
Allison, Miss Helen Loraine    Allison, Miss Helen Loraine  ...       1

[2 rows x 6 columns]

Rename multiple columns names at once.

In [ ]:
df.rename(columns={'PClass': 'Passenger Class', 'Sex': 'Gender'}).head(2)

                                                      Name  ... SexCode
Name                                                        ...
Allen, Miss Elisabeth Walton  Allen, Miss Elisabeth Walton  ...       1
Allison, Miss Helen Loraine    Allison, Miss Helen Loraine  ...       1

[2 rows x 6 columns]

### 6.7 Finding the Min, Max, Sum, Average, and Count

In [ ]:
print('Maximum: ' , df['Age'].max())
print('Minimum: ',(df['Age'].min()))
print('Mean: {}'.format(df['Age'].mean()))
print('Sum: {}'.format(df['Age'].sum()))
print('Count: {}'.format(df['Age'].count()))

Maximum:  71.0
Minimum:  0.17
Mean: 30.397989417989415
Sum: 22980.88
Count: 756

## 6.8 Finding Unique Values

In [ ]:
# unique will return an array of all unique values in a column
df['Sex'].unique()

array(['female', 'male'], dtype=object)

In [ ]:
df['Sex'].nunique()

2

In [ ]:
# value_counts will display all unique values with the number of times each value appears
df['Sex'].value_counts()

male      851
female    462
Name: Sex, dtype: int64

## 6.9 Handling Missing Values

In [ ]:
# select missing values, show 2 rows
df[df['Age'].isnull()].head(2)

                                                      Name  ... SexCode
Name                                                        ...
Aubert, Mrs Leontine Pauline  Aubert, Mrs Leontine Pauline  ...       1
Barkworth, Mr Algernon H          Barkworth, Mr Algernon H  ...       0

[2 rows x 6 columns]

### 6.10 Deleting a Column

In [ ]:
# axis=1 means the column axis
df.drop('Age', axis=1).head(2)

                           Name PClass     Sex  Survived  SexCode
0  Allen, Miss Elisabeth Walton    1st  female         1        1
1   Allison, Miss Helen Loraine    1st  female         0        1

##In Lab Unsolved Problem

Calculate statistical parameter variance , standard deviation, kurtosis, skewness for the whole dataframe.

##Post Lab Unsolved Problem
Apply a custom function "uppercase" to change the case of all elements in "Name" column in the same dataframe.